# -*- coding: utf-8 -*-
"""
Created on Tue Jun 30 23:13:42 2020

@author: ASUS
"""
# 数据源
data_list = [
    ['王*龙', '北京市海淀区苏州街大恒科技大厦南座4层'],
    ['庞*飞', '北京市昌平区汇德商厦四楼403'],
    ['顾*锐', '江苏省扬州市三垛镇工业集中区扬州市立华畜禽有限公司'],
    ['王*飞', '上海市徐汇区上海市徐汇区H88越虹广场B座5E'],
    ['陈*刚', '宁夏省银川市上海东路银佐家园东区11-1-501']
    ]
dict1 = {}  # 初始化字典
dict1 = {   # 赋值大陆的省份：三个字长的省/自治区，两个字长的自治区
    "北京市":[],
    "天津市":[],
    "河北省":[],
    "山西省":[],
    "内蒙古":[],
    "辽宁省":[],
    "吉林省":[],
    "黑龙江":[],
    "上海市":[],
    "江苏省":[],
    "浙江省":[],
    "安徽省":[],
    "福建省":[],
    "江西省":[],
    "山东省":[],
    "河南省":[],
    "湖北省":[],
    "湖南省":[],
    "广东省":[],
    "广西":[],
    "海南省":[],
    "重庆市":[],
    "四川省":[],
    "贵州省":[],
    "云南省":[],
    "西藏":[],
    "陕西省":[],
    "甘肃省":[],
    "青海省":[],
    "宁夏":[],
    "新疆":[],
    }

dict_keys = dict1.keys()  # 以列表形式取出字典的键
for data in data_list:
    province = data[1][0:2]
    for dict_key in dict_keys:
        if province in dict_key:
            dict1[dict_key].append(data)
print(dict1)
        
